{
    "architectures": [
      "XLNetLMHeadModel"
    ],
    "attn_type": "bi",
    "bi_data": false,
    "clamp_len": -1,
    "d_head": 64,
    "d_inner": 1024,
    "d_model": 256,
    "dropout": 0.1,
    "end_n_top": 5,
    "ff_activation": "gelu",
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "mem_len": 64,
    "model_type": "xlnet",
    "n_head": 4,
    "n_layer": 1,
    "reuse_len": null,
    "same_length": false,
    "start_n_top": 5,
    "summary_activation": "tanh",
    "summary_last_dropout": 0.1,
    "summary_type": "last",
    "summary_use_proj": true,
    "untie_r": true
  }